[
  {
    "title": "Python",
    "image": "svgs/python.svg",
    "content": "If Javascript wasn't there, then it would be my favorite language; of course, it is also my first ever programming language."
  },
  {
    "title": "Django",
    "image": "svgs/django.svg",
    "content": "It is extremly handy, and organized, and Django is my preferred framework for e-commerce sites due to its advanced features."
  },
  {
    "title": "JavaScript",
    "image": "svgs/js.svg",
    "content": "JavaScript is my favorite programming language. I feel very comfortable when it comes to working with JavaScript."
  },
  {
    "title": "TypeScript",
    "image": "svgs/typescript.svg",
    "content": "Typescript is known as the drug for developers. Some legend says if you taste typescript once, you will never love other tastes."
  },
  {
    "title": "NextJS",
    "image": "svgs/nextjs.svg",
    "content": "A Beautify creation by vercel \"Next JS\" is consider as best tool to write full-stack apps. "
  },
  {
    "title": "React",
    "image": "svgs/react.svg",
    "content": "The creation of Facebook is  really excellent choice for writing frontend stuff; of course, I am talking about our all-time favorite library, React-js."
  },
  {
    "title": "MongoDB",
    "image": "svgs/mongo.svg",
    "content": "MongoDB is My favorite database because of its syntax and advanced features  which are similar to JavaScript."
  },
  {
    "title": "HTML 5",
    "image": "svgs/html.svg",
    "content": "I mostly use HTML for Hacking purpose  (Just kidding)😉."
  },
  {
    "title": "Scss / Sass",
    "image": "svgs/scss.svg",
    "content": "It's been a long time since I've unlocked the superpower of CSS, called SASS/SCSS, and it's just amazing."
  },
  {
    "title": "Tailwind",
    "image": "svgs/tailwind.svg",
    "content": "A very beautiful micro-framework for writing fast styling. It boosts my speed 2X during styling."
  },
  {
    "title": "Redux Toolkit",
    "image": "svgs/redux.svg",
    "content": "Redux Toolkit is a very beautiful library for state management. It helps a lot while dealing with complex states."
  }
]
